{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "openai/clip-vit-base-patch32",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 256,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 128,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "encoder.layers.10.self_attn.out_proj",
    "encoder.layers.11.self_attn.k_proj",
    "encoder.layers.11.self_attn.out_proj",
    "encoder.layers.10.self_attn.v_proj",
    "encoder.layers.10.self_attn.q_proj",
    "encoder.layers.10.self_attn.k_proj",
    "encoder.layers.11.self_attn.q_proj",
    "encoder.layers.11.self_attn.v_proj"
  ],
  "target_parameters": null,
  "task_type": "FEATURE_EXTRACTION",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}